# YOLO-Master v0.9 🚀 AGPL-3.0 License - https://ultralytics.com/license
# Based on DetailAwareLowRankHybridAdaptiveGateMoE: detail-aware low-rank hybrid experts

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  l: [1.00, 1.00, 512]

# YOLO-Master-v0.9 backbone with DetailAwareLowRankHybridAdaptiveGateMoE
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]         # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]        # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2

  - [-1, 1, Conv, [256, 3, 2]]        # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4

  - [-1, 1, DetailAwareLowRankHybridAdaptiveGateMoE, [512, 4, 2, 0.5]]  # 5 - MoE at P3/P4 junction

  - [-1, 1, Conv, [512, 3, 2]]        # 6-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]   # 7

  - [-1, 1, DetailAwareLowRankHybridAdaptiveGateMoE, [512, 8, 2, 0.5]]  # 8 - MoE at P4/P5 junction

  - [-1, 1, Conv, [1024, 3, 2]]       # 9-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]]   # 10

  - [-1, 1, DetailAwareLowRankHybridAdaptiveGateMoE, [1024, 16, 2, 0.5]] # 11 - MoE at P5

# YOLO-Master-v0.9 OBB head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [[17, 20, 23], 1, OBB, [nc, 1]]
