# YOLO-Master v0.10-MoA AGPL-3.0 License - https://ultralytics.com/license
# Stage 1 MoA variant: VisualEnhancedAdaptiveGateMoE backbone + C2fMoA neck.

nc: 80
scales:
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]

  - [-1, 1, VisualEnhancedAdaptiveGateMoE, [512, 4, 2, 0.5]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 4, A2C2f, [512, True, 4]]

  - [-1, 1, VisualEnhancedAdaptiveGateMoE, [512, 8, 2, 0.5]]

  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 4, A2C2f, [1024, True, 1]]

  - [-1, 1, VisualEnhancedAdaptiveGateMoE, [1024, 16, 2, 0.5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 2, C2fMoA, [512, 2, 6, 2.0, 1.0, True]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 2, C2fMoA, [512, 2, 6, 2.0, 0.8, True]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 2, C2fMoA, [512, 2, 6, 2.0, 0.8, True]]

  - [[17, 20, 23], 1, Detect, [nc]]
