{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "Sequential",
    "parent_library": "torch.nn.modules.container"
  },
  "base_model_name_or_path": null,
  "bias": "none",
  "corda_config": null,
  "eva_config": null,
  "exclude_modules": [
    "model.9.experts.0.conv.depthwise",
    "model.6.experts.2.conv.depthwise",
    "model.model.25.cv3.2.0.0.conv",
    "11.m.1.1.attn.pe.conv",
    "model.model.8.m.1.0.attn.pe.conv",
    "model.3.experts.2.conv.depthwise",
    "model.11.m.0.1.attn.pe.conv",
    "9.experts.0.conv.depthwise",
    "model.12.experts.2.conv.depthwise",
    "model.model.11.m.0.0.attn.pe.conv",
    "model.8.m.0.0.attn.pe.conv",
    "model.9.experts.1.conv.depthwise",
    "model.25.cv3.1.0.0.conv",
    "12.experts.0.conv.depthwise",
    "6.experts.1.conv.depthwise",
    "11.m.0.0.attn.pe.conv",
    "model.model.8.m.0.1.attn.pe.conv",
    "25.cv3.2.0.0.conv",
    "model.11.m.1.0.attn.pe.conv",
    "model.model.11.m.0.1.attn.pe.conv",
    "model.25.cv3.0.0.0.conv",
    "9.experts.2.conv.depthwise",
    "model.model.9.experts.2.conv.depthwise",
    "model.12.experts.0.conv.depthwise",
    "model.11.m.1.1.attn.pe.conv",
    "model.model.3.experts.1.conv.depthwise",
    "8.m.1.1.attn.pe.conv",
    "model.9.experts.2.conv.depthwise",
    "model.8.m.1.1.attn.pe.conv",
    "model.model.6.experts.1.conv.depthwise",
    "model.model.11.m.1.1.attn.pe.conv",
    "model.6.experts.0.conv.depthwise",
    "12.experts.2.conv.depthwise",
    "8.m.0.0.attn.pe.conv",
    "model.model.12.experts.2.conv.depthwise",
    "model.12.experts.1.conv.depthwise",
    "model.model.25.cv3.0.0.0.conv",
    "9.experts.1.conv.depthwise",
    "11.m.1.0.attn.pe.conv",
    "25.cv3.1.1.0.conv",
    "model.25.cv3.0.1.0.conv",
    "model.model.25.cv3.0.1.0.conv",
    "model.model.8.m.1.1.attn.pe.conv",
    "25.cv3.0.0.0.conv",
    "model.3.experts.0.conv.depthwise",
    "model.11.m.0.0.attn.pe.conv",
    "25.cv3.2.1.0.conv",
    "3.experts.1.conv.depthwise",
    "model.model.6.experts.2.conv.depthwise",
    "model.model.25.cv3.1.0.0.conv",
    "model.model.25.cv3.1.1.0.conv",
    "6.experts.0.conv.depthwise",
    "model.25.cv3.2.0.0.conv",
    "6.experts.2.conv.depthwise",
    "model.model.12.experts.0.conv.depthwise",
    "model.model.8.m.0.0.attn.pe.conv",
    "model.model.9.experts.1.conv.depthwise",
    "model.3.experts.1.conv.depthwise",
    "model.model.3.experts.2.conv.depthwise",
    "25.cv3.0.1.0.conv",
    "11.m.0.1.attn.pe.conv",
    "8.m.0.1.attn.pe.conv",
    "model.model.3.experts.0.conv.depthwise",
    "12.experts.1.conv.depthwise",
    "model.8.m.0.1.attn.pe.conv",
    "model.model.11.m.1.0.attn.pe.conv",
    "model.8.m.1.0.attn.pe.conv",
    "model.model.9.experts.0.conv.depthwise",
    "model.25.cv3.1.1.0.conv",
    "model.model.25.cv3.2.1.0.conv",
    "3.experts.0.conv.depthwise",
    "model.6.experts.1.conv.depthwise",
    "model.25.cv3.2.1.0.conv",
    "3.experts.2.conv.depthwise",
    "25.cv3.1.0.0.conv",
    "model.model.6.experts.0.conv.depthwise",
    "8.m.1.0.attn.pe.conv",
    "model.model.12.experts.1.conv.depthwise"
  ],
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_bias": false,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "qalora_group_size": 16,
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": "^(?:model\\.)?(?:0\\.conv|1\\.conv|10\\.conv|11\\.cv1\\.conv|11\\.cv2\\.conv|12\\.routing\\.routing_network\\.0|12\\.routing\\.routing_network\\.2|15\\.cv1\\.conv|15\\.cv2\\.conv|15\\.m\\.0\\.cv1\\.conv|15\\.m\\.0\\.cv2\\.conv|15\\.m\\.0\\.cv3\\.conv|15\\.m\\.0\\.m\\.0\\.cv1\\.conv|15\\.m\\.0\\.m\\.0\\.cv2\\.conv|15\\.m\\.0\\.m\\.1\\.cv1\\.conv|15\\.m\\.0\\.m\\.1\\.cv2\\.conv|18\\.cv1\\.conv|18\\.cv2\\.conv|18\\.m\\.0\\.cv1\\.conv|18\\.m\\.0\\.cv2\\.conv|18\\.m\\.0\\.cv3\\.conv|18\\.m\\.0\\.m\\.0\\.cv1\\.conv|18\\.m\\.0\\.m\\.0\\.cv2\\.conv|18\\.m\\.0\\.m\\.1\\.cv1\\.conv|18\\.m\\.0\\.m\\.1\\.cv2\\.conv|19\\.conv|2\\.cv1\\.conv|2\\.cv2\\.conv|2\\.m\\.0\\.cv1\\.conv|2\\.m\\.0\\.cv2\\.conv|21\\.cv1\\.conv|21\\.cv2\\.conv|21\\.m\\.0\\.cv1\\.conv|21\\.m\\.0\\.cv2\\.conv|21\\.m\\.0\\.cv3\\.conv|21\\.m\\.0\\.m\\.0\\.cv1\\.conv|21\\.m\\.0\\.m\\.0\\.cv2\\.conv|21\\.m\\.0\\.m\\.1\\.cv1\\.conv|21\\.m\\.0\\.m\\.1\\.cv2\\.conv|22\\.conv|24\\.cv1\\.conv|24\\.cv2\\.conv|24\\.m\\.0\\.cv1\\.conv|24\\.m\\.0\\.cv2\\.conv|24\\.m\\.0\\.cv3\\.conv|24\\.m\\.0\\.m\\.0\\.cv1\\.conv|24\\.m\\.0\\.m\\.0\\.cv2\\.conv|24\\.m\\.0\\.m\\.1\\.cv1\\.conv|24\\.m\\.0\\.m\\.1\\.cv2\\.conv|25\\.cv2\\.0\\.0\\.conv|25\\.cv2\\.0\\.1\\.conv|25\\.cv2\\.0\\.2|25\\.cv2\\.1\\.0\\.conv|25\\.cv2\\.1\\.1\\.conv|25\\.cv2\\.1\\.2|25\\.cv2\\.2\\.0\\.conv|25\\.cv2\\.2\\.1\\.conv|25\\.cv2\\.2\\.2|25\\.cv3\\.0\\.0\\.1\\.conv|25\\.cv3\\.0\\.1\\.1\\.conv|25\\.cv3\\.0\\.2|25\\.cv3\\.1\\.0\\.1\\.conv|25\\.cv3\\.1\\.1\\.1\\.conv|25\\.cv3\\.1\\.2|25\\.cv3\\.2\\.0\\.1\\.conv|25\\.cv3\\.2\\.1\\.1\\.conv|25\\.cv3\\.2\\.2|3\\.routing\\.routing_network\\.0|3\\.routing\\.routing_network\\.2|4\\.conv|5\\.cv1\\.conv|5\\.cv2\\.conv|5\\.m\\.0\\.cv1\\.conv|5\\.m\\.0\\.cv2\\.conv|6\\.routing\\.routing_network\\.0|6\\.routing\\.routing_network\\.2|7\\.conv|8\\.cv1\\.conv|8\\.cv2\\.conv|9\\.routing\\.routing_network\\.0|9\\.routing\\.routing_network\\.2)$",
  "target_parameters": null,
  "task_type": null,
  "trainable_token_indices": null,
  "use_dora": false,
  "use_qalora": false,
  "use_rslora": true
}