# YOLO-Master v0.10 🚀 AGPL-3.0 License - https://ultralytics.com/license
# Based on VisualEnhancedAdaptiveGateMoE: detail-and-context enhanced visual experts

# Parameters
nc: 1000
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO-Master-v0.10 backbone with VisualEnhancedAdaptiveGateMoE
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]         # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]        # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2

  - [-1, 1, Conv, [256, 3, 2]]        # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4

  - [-1, 1, VisualEnhancedAdaptiveGateMoE, [512, 4, 2, 0.5]]  # 5 - MoE at P3/P4 junction

  - [-1, 1, Conv, [512, 3, 2]]        # 6-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]   # 7

  - [-1, 1, VisualEnhancedAdaptiveGateMoE, [512, 8, 2, 0.5]]  # 8 - MoE at P4/P5 junction

  - [-1, 1, Conv, [1024, 3, 2]]       # 9-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]]   # 10

  - [-1, 1, VisualEnhancedAdaptiveGateMoE, [1024, 16, 2, 0.5]] # 11 - MoE at P5

head:
  - [-1, 1, Classify, [nc]]
